In [ ]:
pip install pandas

In [2]:
import pandas as pd

In [3]:

df1 = pd.read_csv('data/nominal-index_csv.csv')
df2 = pd.read_csv('data/nominal-year_csv.csv')
df3 = pd.read_csv('data/real-index_csv.csv')
df4 = pd.read_csv('data/real-year_csv.csv')

In [4]:
df2

             date                    country   price
0      1966-03-31  Emerging market economies     NaN
1      1966-03-31         Advanced economies     NaN
2      1966-03-31       United Arab Emirates     NaN
3      1966-03-31                    Austria     NaN
4      1966-03-31                  Australia     NaN
...           ...                        ...     ...
12622  2017-09-30                   Thailand  128.52
12623  2017-09-30                     Turkey  244.55
12624  2017-09-30              United States     NaN
12625  2017-09-30                  Euro area     NaN
12626  2017-09-30               South Africa  143.11

[12627 rows x 3 columns]

In [5]:
df2

             date                    country  price
0      1966-03-31  Emerging market economies    NaN
1      1966-03-31         Advanced economies    NaN
2      1966-03-31       United Arab Emirates    NaN
3      1966-03-31                    Austria    NaN
4      1966-03-31                  Australia    NaN
...           ...                        ...    ...
12622  2017-09-30                   Thailand   0.23
12623  2017-09-30                     Turkey  11.31
12624  2017-09-30              United States    NaN
12625  2017-09-30                  Euro area    NaN
12626  2017-09-30               South Africa   3.75

[12627 rows x 3 columns]

In [6]:
df3

             date                    country   price
0      1966-03-31  Emerging market economies     NaN
1      1966-03-31         Advanced economies     NaN
2      1966-03-31       United Arab Emirates     NaN
3      1966-03-31                    Austria     NaN
4      1966-03-31                  Australia     NaN
...           ...                        ...     ...
12622  2017-09-30                   Thailand  115.55
12623  2017-09-30                     Turkey  139.83
12624  2017-09-30              United States     NaN
12625  2017-09-30                  Euro area     NaN
12626  2017-09-30               South Africa   97.83

[12627 rows x 3 columns]

In [7]:
df4

             date                    country  price
0      1966-03-31  Emerging market economies    NaN
1      1966-03-31         Advanced economies    NaN
2      1966-03-31       United Arab Emirates    NaN
3      1966-03-31                    Austria    NaN
4      1966-03-31                  Australia    NaN
...           ...                        ...    ...
12622  2017-09-30                   Thailand  -0.22
12623  2017-09-30                     Turkey   0.68
12624  2017-09-30              United States    NaN
12625  2017-09-30                  Euro area    NaN
12626  2017-09-30               South Africa  -0.99

[12627 rows x 3 columns]

In [8]:
df2 = df2.dropna()
df2 # should expect 12627 - 8066  = 4561

             date       country   price
60     1966-03-31  South Africa    1.08
121    1966-06-30  South Africa    1.11
182    1966-09-30  South Africa    1.10
243    1966-12-31  South Africa    1.14
304    1967-03-31  South Africa    1.26
...           ...           ...     ...
12608  2017-09-30   Netherlands  102.44
12609  2017-09-30        Norway  146.19
12622  2017-09-30      Thailand  128.52
12623  2017-09-30        Turkey  244.55
12626  2017-09-30  South Africa  143.11

[4561 rows x 3 columns]

In [29]:
# Making new columns for year and quarter
df2['date'] = pd.to_datetime(df1['date'])

df1['year'] = df1['date'].dt.year
df1['quarter'] = df1['date'].dt.quarter


df1

C:\Users\nadya\AppData\Local\Temp\ipykernel_900\1165405710.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['date'] = pd.to_datetime(df1['date'])
C:\Users\nadya\AppData\Local\Temp\ipykernel_900\1165405710.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['year'] = df1['date'].dt.year
C:\Users\nadya\AppData\Local\Temp\ipykernel_900\1165405710.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['quarter'] = df1['date'].dt.quarter

            date       country   price  year  quarter
60    1966-03-31  South Africa    1.08  1966        1
121   1966-06-30  South Africa    1.11  1966        2
182   1966-09-30  South Africa    1.10  1966        3
243   1966-12-31  South Africa    1.14  1966        4
304   1967-03-31  South Africa    1.26  1967        1
...          ...           ...     ...   ...      ...
12608 2017-09-30   Netherlands  102.44  2017        3
12609 2017-09-30        Norway  146.19  2017        3
12622 2017-09-30      Thailand  128.52  2017        3
12623 2017-09-30        Turkey  244.55  2017        3
12626 2017-09-30  South Africa  143.11  2017        3

[4561 rows x 5 columns]

In [30]:
df1.to_csv('data/nominal-index_csv_cleaned.csv', index = False)

In [18]:
df2 = df2.dropna()
df2 # should expect 12627 - 8310  = 4317

             date       country  price
304    1967-03-31  South Africa  16.51
365    1967-06-30  South Africa  18.09
426    1967-09-30  South Africa  23.08
487    1967-12-31  South Africa  18.51
548    1968-03-31  South Africa   5.00
...           ...           ...    ...
12608  2017-09-30   Netherlands   8.63
12609  2017-09-30        Norway   2.47
12622  2017-09-30      Thailand   0.23
12623  2017-09-30        Turkey  11.31
12626  2017-09-30  South Africa   3.75

[4317 rows x 3 columns]

In [31]:
# Making new columns for year and quarter
df2['date'] = pd.to_datetime(df2['date'])

df2['year'] = df2['date'].dt.year
df2['quarter'] = df2['date'].dt.quarter


df2

            date       country  price  year  quarter
304   1967-03-31  South Africa  16.51  1967        1
365   1967-06-30  South Africa  18.09  1967        2
426   1967-09-30  South Africa  23.08  1967        3
487   1967-12-31  South Africa  18.51  1967        4
548   1968-03-31  South Africa   5.00  1968        1
...          ...           ...    ...   ...      ...
12608 2017-09-30   Netherlands   8.63  2017        3
12609 2017-09-30        Norway   2.47  2017        3
12622 2017-09-30      Thailand   0.23  2017        3
12623 2017-09-30        Turkey  11.31  2017        3
12626 2017-09-30  South Africa   3.75  2017        3

[4317 rows x 5 columns]

In [32]:
df2.to_csv('data/nominal-year_csv_cleaned.csv', index = False)

In [20]:
df3 = df3.dropna()
df3 # should expect 12627 - 8066 = 4561

             date       country   price
60     1966-03-31  South Africa   56.13
121    1966-06-30  South Africa   56.81
182    1966-09-30  South Africa   55.86
243    1966-12-31  South Africa   57.05
304    1967-03-31  South Africa   63.09
...           ...           ...     ...
12608  2017-09-30   Netherlands   91.86
12609  2017-09-30        Norway  127.29
12622  2017-09-30      Thailand  115.55
12623  2017-09-30        Turkey  139.83
12626  2017-09-30  South Africa   97.83

[4561 rows x 3 columns]

In [33]:
# Making new columns for year and quarter
df3['date'] = pd.to_datetime(df3['date'])

df3['year'] = df3['date'].dt.year
df3['quarter'] = df3['date'].dt.quarter


df3

            date       country   price  year  quarter
60    1966-03-31  South Africa   56.13  1966        1
121   1966-06-30  South Africa   56.81  1966        2
182   1966-09-30  South Africa   55.86  1966        3
243   1966-12-31  South Africa   57.05  1966        4
304   1967-03-31  South Africa   63.09  1967        1
...          ...           ...     ...   ...      ...
12608 2017-09-30   Netherlands   91.86  2017        3
12609 2017-09-30        Norway  127.29  2017        3
12622 2017-09-30      Thailand  115.55  2017        3
12623 2017-09-30        Turkey  139.83  2017        3
12626 2017-09-30  South Africa   97.83  2017        3

[4561 rows x 5 columns]

In [34]:
df3.to_csv('data/real-index_csv_cleaned.csv', index = False)

In [22]:
df4 = df4.dropna()
df4 # should expect 12627 - 8310 = 4317

             date       country  price
304    1967-03-31  South Africa  12.40
365    1967-06-30  South Africa  13.42
426    1967-09-30  South Africa  17.98
487    1967-12-31  South Africa  16.05
548    1968-03-31  South Africa   2.82
...           ...           ...    ...
12608  2017-09-30   Netherlands   7.14
12609  2017-09-30        Norway   0.96
12622  2017-09-30      Thailand  -0.22
12623  2017-09-30        Turkey   0.68
12626  2017-09-30  South Africa  -0.99

[4317 rows x 3 columns]

In [35]:
# Making new columns for year and quarter
df4['date'] = pd.to_datetime(df4['date'])

df4['year'] = df4['date'].dt.year
df4['quarter'] = df4['date'].dt.quarter


df4

C:\Users\nadya\AppData\Local\Temp\ipykernel_900\2337301760.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4['date'] = pd.to_datetime(df4['date'])
C:\Users\nadya\AppData\Local\Temp\ipykernel_900\2337301760.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4['year'] = df4['date'].dt.year
C:\Users\nadya\AppData\Local\Temp\ipykernel_900\2337301760.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4['quarter'] = df4['date'].dt.quarter

            date       country  price  year  quarter
304   1967-03-31  South Africa  12.40  1967        1
365   1967-06-30  South Africa  13.42  1967        2
426   1967-09-30  South Africa  17.98  1967        3
487   1967-12-31  South Africa  16.05  1967        4
548   1968-03-31  South Africa   2.82  1968        1
...          ...           ...    ...   ...      ...
12608 2017-09-30   Netherlands   7.14  2017        3
12609 2017-09-30        Norway   0.96  2017        3
12622 2017-09-30      Thailand  -0.22  2017        3
12623 2017-09-30        Turkey   0.68  2017        3
12626 2017-09-30  South Africa  -0.99  2017        3

[4317 rows x 5 columns]

In [36]:
df4.to_csv('data/real-year_csv_cleaned.csv')

In [40]:
df2.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [6]:
import pandas as pd
df4 = pd.read_csv('data/real-year_csv_cleaned.csv')
# Making new columns for year and quarter
df4['date'] = pd.to_datetime(df4['date'])

df4['year'] = df4['date'].dt.year
df4['quarter'] = df4['date'].dt.quarter


df4
df4.to_csv('data/real-year_csv_cleaned.csv', index = False)

In [3]:
df2 = pd.read_csv('data/nominal-year_csv_cleaned.csv')
df2.max()

country     Australia
date       1967-03-31
price          -42.25
year             1967
quarter             1
dtype: object